const List<String> nameProduct = [
  "Арахіс очищений",
  "Борошно кукурудзяне",
  "Борошно пшеничне",
  "Варення",
  "Вершки",
  "Висівки",
  "Вишня свіжа",
  "Вода",
  "Горілка",
  "Горіх фундук (ядро)",
  "Горіхи товчені",
  "Горобина свіжа",
  "Горох лущений",
  "Горох нелущений",
  "Гречана крупа",
  "Гриби сушені",
  "Желатин в порошку",
  "Ізюм",
  "Кава мелена",
  "Кава смажена в зернах",
  "Какао-порошок",
  "Квасоля",
  "Кефір",
  "Кислота лимонна суха",
  "Кокосова крошка",
  "Кориця мелена",
  "Крохмаль",
  "Крупа Геркулес",
  "Крупа гречана",
  "Крупа манна",
  "Крупа перлова",
  "Крупа пшоняна",
  "Крупа рисова",
  "Крупа ячмінна",
  "Крупа ячна",
  "Кукурудзяна мука",
  "Лікер",
  "Майонез",
  "Мак",
  "Макарони",
  "Малина свіжа",
  "Маргарин розтоплений",
  "Масло рослинне",
  "Масло топлене",
  "Мед",
  "Мигдаль очищений",
  "Молоко згущене",
  "Молоко незбиране",
  "Молоко сухе",
  "Мука кукурудзяна",
  "Мука пшенична",
  "Мука ржана",
  "Насіння гарбуза смажене",
  "Насіння сонішника смажене",
  "Овес",
  "Олія оливова",
  "Олія соняшникова",
  "Оцет",
  "Перець мелений",
  "Пиво",
  "Пластівці вівсяні",
  "Пластівці кукурудзяні",
  "Пластівці пшеничні",
  "Полуниця свіжа",
  "Попкорн",
  "Пюре фруктове",
  "Рис",
  "Родзинки",
  "Розпушувач для тіста",
  "Саго",
  "Сіль",
  "Сметана",
  "Сода харчова",
  "Сочевиця",
  "Суниця свіжа",
  "Сухарі мелені",
  "Томатна паста",
  "Томат-пюре",
  "Цукор пилений",
  "Цукор пісок",
  "Цукор тросниковий",
  "Цукрова пудра",
  "Чай сухий",
  "Чипси",
  "Чорна смородина",
  "Чорниця сушена",
  "Яєчний порошок",
];

Map<String, dynamic> products = {
  "Арахіс очищений": {"name": "Арахіс очищений", "density": 0.7, "loose": true},
  "Борошно кукурудзяне": {
    "name": "Борошно кукурудзяне",
    "density": 0.64,
    "loose": true
  },
  "Борошно пшеничне": {
    "name": "Борошно пшеничне",
    "density": 0.64,
    "loose": true
  },
  "Варення": {"name": "Варення", "density": 1.32, "loose": false},
  "Вершки": {"name": "Вершки", "density": 1.03, "loose": false},
  "Висівки": {"name": "Висівки", "density": 0.26, "loose": true},
  "Вишня свіжа": {"name": "Вишня свіжа", "density": 0.76, "loose": true},
  "Вода": {"name": "Вода", "density": 1.0, "loose": false},
  "Горілка": {"name": "Горілка", "density": 0.94, "loose": false},
  "Горіх фундук (ядро)": {
    "name": "Горіх фундук (ядро)",
    "density": 0.68,
    "loose": true
  },
  "Горіхи товчені": {"name": "Горіхи товчені", "density": 0.68, "loose": true},
  "Горобина свіжа": {"name": "Горобина свіжа", "density": 0.64, "loose": true},
  "Горох лущений": {"name": "Горох лущений", "density": 0.92, "loose": true},
  "Горох нелущений": {"name": "Горох нелущений", "density": 0.8, "loose": true},
  "Гречана крупа": {"name": "Гречана крупа", "density": 0.84, "loose": true},
  "Гриби сушені": {"name": "Гриби сушені", "density": 0.4, "loose": true},
  "Желатин в порошку": {
    "name": "Желатин в порошку",
    "density": 1.3,
    "loose": true
  },
  "Ізюм": {"name": "Ізюм", "density": 0.76, "loose": true},
  "Кава мелена": {"name": "Кава мелена", "density": 0.75, "loose": true},
  "Кава смажена в зернах": {
    "name": "Кава смажена в зернах",
    "density": 0.43,
    "loose": true
  },
  "Какао-порошок": {"name": "Какао-порошок", "density": 0.65, "loose": true},
  "Квасоля": {"name": "Квасоля", "density": 0.84, "loose": true},
  "Кефір": {"name": "Кефір", "density": 1.03, "loose": false},
  "Кислота лимонна суха": {
    "name": "Кислота лимонна суха",
    "density": 1.389,
    "loose": true
  },
  "Кокосова крошка": {
    "name": "Кокосова крошка",
    "density": 0.35,
    "loose": true
  },
  "Кориця мелена": {"name": "Кориця мелена", "density": 1.1112, "loose": true},
  "Крохмаль": {"name": "Крохмаль", "density": 0.72, "loose": true},
  "Крупа Геркулес": {"name": "Крупа Геркулес", "density": 0.28, "loose": true},
  "Крупа гречана": {"name": "Крупа гречана", "density": 0.84, "loose": true},
  "Крупа манна": {"name": "Крупа манна", "density": 0.8, "loose": true},
  "Крупа перлова": {"name": "Крупа перлова", "density": 0.92, "loose": true},
  "Крупа пшоняна": {"name": "Крупа пшоняна", "density": 0.88, "loose": true},
  "Крупа рисова": {"name": "Крупа рисова", "density": 0.96, "loose": true},
  "Крупа ячмінна": {"name": "Крупа ячмінна", "density": 0.72, "loose": true},
  "Крупа ячна": {"name": "Крупа ячна", "density": 0.72, "loose": true},
  "Кукурудзяна мука": {
    "name": "Кукурудзяна мука",
    "density": 0.64,
    "loose": true
  },
  "Лікер": {"name": "Лікер", "density": 1.1, "loose": false},
  "Майонез": {"name": "Майонез", "density": 0.94, "loose": false},
  "Мак": {"name": "Мак", "density": 0.66, "loose": true},
  "Макарони": {"name": "Макарони", "density": 0.38, "loose": true},
  "Малина свіжа": {"name": "Малина свіжа", "density": 0.56, "loose": true},
  "Маргарин розтоплений": {
    "name": "Маргарин розтоплений",
    "density": 0.92,
    "loose": true
  },
  "Масло рослинне": {"name": "Масло рослинне", "density": 0.92, "loose": true},
  "Масло топлене": {"name": "Масло топлене", "density": 0.91, "loose": true},
  "Мед": {"name": "Мед", "density": 1.3, "loose": false},
  "Мигдаль очищений": {
    "name": "Мигдаль очищений",
    "density": 0.64,
    "loose": true
  },
  "Молоко згущене": {"name": "Молоко згущене", "density": 1.3, "loose": false},
  "Молоко незбиране": {
    "name": "Молоко незбиране",
    "density": 1.02,
    "loose": false
  },
  "Молоко сухе": {"name": "Молоко сухе", "density": 0.48, "loose": true},
  "Мука кукурудзяна": {
    "name": "Мука кукурудзяна",
    "density": 0.67,
    "loose": true
  },
  "Мука пшенична": {"name": "Мука пшенична", "density": 0.7, "loose": true},
  "Мука ржана": {"name": "Мука ржана", "density": 0.65, "loose": true},
  "Насіння гарбуза смажене": {
    "name": "Насіння гарбуза смажене",
    "density": 0.35,
    "loose": true
  },
  "Насіння сонішника смажене": {
    "name": "Насіння сонішника смажене",
    "density": 0.36,
    "loose": true
  },
  "Овес": {"name": "Овес", "density": 0.44, "loose": true},
  "Олія оливова": {"name": "Олія оливова", "density": 0.96, "loose": false},
  "Олія соняшникова": {
    "name": "Олія соняшник",
    "density": 0.96,
    "loose": false
  },
  "Оцет": {"name": "Оцет", "density": 1, "loose": false},
  "Перець мелений": {"name": "Перець мелений", "density": 1, "loose": true},
  "Пиво": {"name": "Пиво", "density": 1.03, "loose": true},
  "Пластівці вівсяні": {
    "name": "Пластівці вівсяні",
    "density": 0.4,
    "loose": true
  },
  "Пластівці кукурудзяні": {
    "name": "Пластівці кукурудзяні",
    "density": 0.2,
    "loose": true
  },
  "Пластівці пшеничні": {
    "name": "Пластівці пшеничні",
    "density": 0.24,
    "loose": true
  },
  "Полуниця свіжа": {"name": "Полуниця свіжа", "density": 0.6, "loose": true},
  "Попкорн": {"name": "Попкорн", "density": 0.04, "loose": true},
  "Пюре фруктове": {"name": "Пюре фруктове", "density": 1.4, "loose": false},
  "Рис": {"name": "Рис", "density": 0.78, "loose": true},
  "Родзинки": {"name": "Родзинки", "density": 0.76, "loose": true},
  "Розпушувач для тіста": {
    "name": "Розпушувач для тіста",
    "density": 0.72,
    "loose": true
  },
  "Саго": {"name": "Саго", "density": 0.72, "loose": true},
  "Сіль": {"name": "Сіль", "density": 1.28, "loose": true},
  "Сметана": {"name": "Сметана", "density": 1.05, "loose": false},
  "Сода харчова": {"name": "Сода харчова", "density": 0.69, "loose": true},
  "Сочевиця": {"name": "Сочевиця", "density": 0.84, "loose": true},
  "Суниця свіжа": {"name": "Суниця свіжа", "density": 0.68, "loose": true},
  "Сухарі мелені": {"name": "Сухарі мелені", "density": 0.52, "loose": true},
  "Томатна паста": {"name": "Томатна паста", "density": 1.08, "loose": false},
  "Томат-пюре": {"name": "Томат-пюре", "density": 0.88, "loose": false},
  "Цукор пилений": {"name": "Цукор пилений", "density": 0.8, "loose": true},
  "Цукор пісок": {"name": "Цукор пісок", "density": 0.92, "loose": true},
  "Цукор тросниковий": {
    "name": "Цукор тросниковий",
    "density": 0.96,
    "loose": true
  },
  "Цукрова пудра": {"name": "Цукрова пудра", "density": 0.76, "loose": true},
  "Чай сухий": {"name": "Чай сухий", "density": 0.16, "loose": true},
  "Чипси": {"name": "Чипси", "density": 0.09, "loose": true},
  "Чорна смородина": {
    "name": "Чорна смородина",
    "density": 0.72,
    "loose": true
  },
  "Чорниця сушена": {"name": "Чорниця сушена", "density": 0.54, "loose": true},
  "Яєчний порошок": {"name": "Яєчний порошок", "density": 0.4, "loose": true}
};

const List<String> units = [
  "Стакан 250 мл",
  "Чашка 200 мл",
  "Літр",
  "Мілілітр",
  "Столова ложка",
  "Чайна ложка",
  "Кілограм",
  "Грам",
];

Map<String, dynamic> measure = {
  "Стакан 250 мл": {
    "label": "стакан",
    "factor": 0.25,
    "vol": true,
    "from2to4": "стакани",
    "from5to0": "стаканів",
    "fraction": "стакана"
  },
  "Чашка 200 мл": {
    "label": "чашка",
    "factor": 0.2,
    "vol": true,
    "from2to4": "чашки",
    "from5to0": "чашок",
    "fraction": "чашки"
  },
  "Літр": {
    "label": "літр",
    "factor": 1.0,
    "vol": true,
    "from2to4": "літра",
    "from5to0": "літрів",
    "fraction": "літра"
  },
  "Мілілітр": {
    "label": "мілілітр",
    "factor": 0.001,
    "vol": true,
    "from2to4": "мілілітра",
    "from5to0": "мілілітрів",
    "fraction": "мілілітра"
  },
  "Столова ложка": {
    "label": "столова ложка",
    "factor": 0.018,
    "vol": true,
    "from2to4": "столові ложки",
    "from5to0": "столових ложек",
    "fraction": "столової ложки"
  },
  "Чайна ложка": {
    "label": "чайна ложка",
    "factor": 0.005,
    "vol": true,
    "from2to4": "чайні ложки",
    "from5to0": "чайних ложек",
    "fraction": "чайної ложки"
  },
  "Грам": {
    "label": "грам",
    "factor": 0.001,
    "vol": false,
    "from2to4": "грами",
    "from5to0": "грамів",
    "fraction": "грама"
  },
  "Кілограм": {
    "label": "кілограм",
    "factor": 1.0,
    "vol": false,
    "from2to4": "кілограми",
    "from5to0": "кілограмів",
    "fraction": "кілограма"
  },
};
